{
  "aboutMe": {
    "firstParagraph": "Hello!  My name is Connor and I am a software engineer currently living in New York City.  I began my programming journey while attending the University of Arizona. I worked in a scientific research lab studying life history strategies of black widow spiders.  As I began taking more  responsibilities, I started learning programming in Python and R to conduct data analysis and visualization.",
    "secondParagraph": "As graduation approached I started looking for a job and applied to an engineering position at American Express.  In a twist of fate, I ended up on a web engineering team instead of the data analytics team.  I have since fallen in love with software development have been professionally working in the field for 2.5 years.  In my spare time I enjoy traveling, playing guitar, playing video games with friends, and working out.",
    "header": "About Me"
  },
  "technicalSkills": {
    "header": "Technical Skills",
    "firstListItem": "Programming Languages: ",
    "firstListContent": "HTML, CSS, Markdown, Javascript, Typescript, RegEx, R, Bash scripting / linux",
    "secondListItem": "Technologies: ",
    "secondListContent": "Git, NodeJS, NPM, React, AngularJS, WebdriverIO, Storybook, CypressIO, Karma, Jest, Yup, Formik, Playwright, Jenkins, Gitlab, Material UI, Postman"
  },
  "workExperience": {
    "americanExpress": {
      "logoUrl": "https://s1.q4cdn.com/692158879/files/images/brand_imagery/AXP_BlueBoxLogo_Alternate_REGULARscale_RGB_DIGITAL_700x700.png",
      "name": "American Express - Software Engineer",
      "description": "I first joined AMEX in August of 2019 after graduating from university. My senior fall semester I interviewed and was presumably hired for a data engineering / data science team in Phoenix. However, an HR mix up landed me on a web engineering team, which at the time, I had zero experience in. Since my background wasn't in traditional software development, I was challenged very quickly to ramp up to the complex technology stack for Digital Acquisitions. My first project entailed learning HTML, CSS, and Javascript to uplift a legacy web application to modern design standards and web tech stack from AngularJS to React.  After this project I took several features building out automation testing suites and learning AGILE methodologies, serving as scrum master for my team over multiple PI’s.  I was promoted and began taking on more responsibilities such as bringing features from architecture planning through development to supporting release in production.   In addition to this I’ve since built a multitude of reusable UI holocrons and components which have been implemented in various applications at the company by multiple teams.  I also regularly participate in company hackathons and very much enjoy being a part of the company’s internal tech culture.",
      "position": "Software Engineer",
      "tenure": "August 2019 - Present"
    },
    "uOfA": {
      "logoUrl": "https://phoenixmed.arizona.edu/sites/default/files/campus/marcomm/brand/master-logo/10-ua-vertical-white/ua_rev_stack_rgb_white.png",
      "name": "University of Arizona",
      "description": " I first started as an undergraduate researcher I supervised collection data to maintain a large online cloud database. As I began taking more responsibilities,   Our research specifically involved black widow spiders, and being real life organisms, the data their behavior produced was messy.  My PI tasked me with cleaning the data in preparation for statistical analysis.  I loved statistics in college and did very well enough to serve as TA in Introduction to Business Analytics.   After showing interest, my PI then gave me the responsibility of performing data analysis using R and Python.  I would perform linear regression, as well as various statistical tests in order to investigate and establish potential relationships between parameters of interest.  After our primary project had come to its final stages of development, I presented our research at UofA’s UBRP (Undergraduate Research Program) Annual Symposium to a diverse audience, eventually leading to our research being published in a scientific journal. ",
      "position": "Undergraduate Researcher",
      "tenure": "April 2017 - May 2019"
    }
  }
}
